/*
 * Можливість пропонувати себе як репетитора - заробляти з репетиторів
 * Набір відосиків на мові вивчення з фільтрами як тут https://www.tagalog.com/videos/ . В тому числі фільтр по музиці + ліриці як тут https://www.tagalog.com/music/
 * режим швидкого перекладу через гугл транслейт зразу з/на потрібну мову в одинк клік
 
 * Інтелектуальний режим - тренування на тих фразах які погано відстрелюються (на яких були помилки за останні 10 висвічувань). Якщо таких фраз нуль - показувати зразу всі слова в тому числі відсіяні. Якщо всі-всі-всі слова уроку слова вгадуються 2 рази підряд - радиться перехід на наступний урок. Цей режим може відноситися до будь-якого режиму гри.
 
 * зграбить по відосам відповідної мови автоматично згенеровані саби і зібрати статистику частоти вживання слів.
 */



/*
 * Режим вивчання фраз/слів. Всі фрази показуються лише в мові перекладу + можливість прослухати по кліку. Зправа показуються фраза+переклад + слова + переклад слова.
 * Тренування вимови: є текст - записуєш аудіо - прослуховується оригінал + записане аудіо
 * з Оріг написати текстом транслейт або сказати в мікрофон + навпаки
 * Словникові картки: показується шафлова фраза - по кліку - перегортається на переклад
 * Гра на аудіювання - тобі кажуть фразу нашою - повинен клікнути яка з фраз відповідає перекладу. + навпаки.
 * https://www.tagalog.com/drills/drill.php?drill_id=6&csid=51
 * https://www.tagalog.com/drills/drill.php?drill_id=11&csid=55
 * https://www.tagalog.com/drills/drill.php?drill_id=15&csid=62

 ________________
 кожна гра має 2 режими: слова, фрази
*/

/*
 * Можливість створювати власні кастомні уроки (і забирать їх собі на сервер для переглядання). Можливість фейворіти виставляти ?
 * Отримувати скидки на підписку завдяки допомаганню сервісу в перекладі на свою мову з якоїсь яку знаєш. Це повинно відправитись на модерацію (іншим юзерам? мені?)
 
 * Через тиждень користування апкою (7 дныв з включанням) - видавати вікно "для безкоштовного проходу" в якому ти повинен дозаповнить або перепровірити бібліотеку новими словами чи фразами чи перекладами. Попереджати що все - модерується. І що за неправильні відповіді - буде покарання в вигляді збільшення к-сті слів для входження в програму. Що б прибрати цю вискакуючу капчу - потрібно заплатить бабло.
 */

/*
 Не забувай! Робочий мінімальний прототип ліпше за недописану круту програму.
 
 Почни з безкоштовного паблішинга. Де люби без підписок наберуться.
 
 Також в автоматичному режимі зграб з того сайту всі мови
 
 Також дай можливість юзерам записувати фразу своєю мовою як читається що б це заливалось мені на сервер.
 
 Зроби переклад свого інтерфейсу на всі мови сходу. Це повинно бути мінімум слів в інтерфейсі
 */
